posts/2022-11-07-cleaning-up-after-lsp/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 21 Dec. 2022 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cleaning up after LSP-mode</title>
<meta name="author" content="Arjen Wiersma" />
<meta name="generator" content="Org Mode" />
<meta description='Writings by Arjen'/>
<link rel='alternate' type='application+rss/xml' title='Writings by Arjen' href='/posts/rss.xml'/>
<link rel="stylesheet" href="../../css/theme.css?v=20216e086cf8a20ead56908f3be0bcda6af2531ec1a68c9058ee7495590f57ea" type="text/css">
</head>
<body>
<main id="content" class="content">
<header>
<h1 class="title">Cleaning up after LSP-mode</h1>
<p class="subtitle" role="doc-subtitle">Nov 07, 2022</p>
</header><p>
I use <a href="https://emacs-lsp.github.io/lsp-mode/">lsp-mode</a> quite extensively. I switched from eglot when I started using LSP more. The beautify of lsp-mode is that it will automatically install language servers as you need them. It also integrates excellently with <a href="https://emacs-lsp.github.io/dap-mode/">dap-mode</a> to enable debugging sessions. So, I switched to it, turned off all the information overload and I am quite happy.
</p>

<p>
One thing I do extensively is that I use LaTeX to make my slides for college class slides and class assignments. That means I have hundreds of directories with presentations, assignments and other documents. Each time I enter a directory for a class it will spawn an LSP session for that set of LaTeX files.
</p>

<p>
Then there are the assignments that are handed in. Mostly Java and JavaScript types of projects that I grade. This is wonderful work and I am glad I can do it within Emacs, instead of having to spawn up some IDE to just browse code structures.
</p>

<p>
The downside to all this is that my <code>lsp-describe-session</code> list becomes huge. At one point I had over 100 sessions stored in it, most of them fleeting due to work I graded at the end of a semester. Luckily you can just clean those folders up by calling <code>lsp-workspace-folders-remove</code>. As an interactive function you can call it, select the folder to remove and be done with it.
</p>

<p>
Needless to say that I did not feel like doing that manually for 100+ folders. So I created a small snippet of elisp to automate this. It is listed below, feel free to copy it. It will clean out <b>all</b> your LSP folders, so you will need to create the ones you need again after using it, but <code>lsp-mode</code> will do just that for you.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">aw/cleanup-lsp</span> ()
  <span class="org-doc">"Remove all the workspace folders from LSP"</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((folders (lsp-session-folders (lsp-session))))
    (<span class="org-keyword">while</span> folders
      (lsp-workspace-folders-remove (car folders))
      (<span class="org-keyword">setq</span> folders (cdr folders)))))
</pre>
</div>

<p>
Go back to the <a href="../../index.html">homepage</a>.
</p>
</main>
</body>
</html>